; domain
(define (domain atwork)
(:requirements :negative-preconditions)
(:predicates (At ?place) (Have ?ob) (On ?ob ?place))

(:action Move
  :parameters (?initPlace ?finalPlace)
  :precondition (and (At ?initPlace) (not(At ?finalPlace)))
  :effect (and (At ?finalPlace) 
               (not (At ?initPlace))))
(:action Pick
  :parameters  (?ob ?place)
  :precondition (and (At ?place) (On ?ob ?place))
  :effect (and(Have ?ob)
	      (not (On ?ob ?place))))

(:action Drop
  :parameters  (?ob ?place)
  :precondition (and (Have ?ob) (At ?place))
  :effect (and(not(Have ?ob))
	      (On ?ob ?place))))

; problem
(define (problem atwork3)
        (:domain atwork)	
        (:objects o1 o2 o3 o4 o51 o52 o6 o7 o8 s1 s2 s3 s4 s5 s6)
        (:init (On o1 s5)
	       (On o4 s5)
	       (On o51 s5)
	       (On o3 s2)
	       (On o52 s2)
	       (On o7 s2)
	       (On o2 s3)
	       (On o6 s3)
	       (On o8 s3)
	       (At s1)
	       (not(At s2))
	       (not(At s3))
	       (not(At s4))
	       (not(At s5))
	       (not(At s6)))
   (:goal 
     (and (On o3 s1)
	  (On o4 s1)
	  (On o6 s1)
	  (On o51 s4)
	  (On o52 s4)
	  (On o8 s4)
	  (On o1 s6)
	  (On o2 s6)
	  (On o7 s6))))

; plan
1. (move s1 s5)
   deleted: (at s1)
   added: (at s5)
   goals met: 0 of 9
2. (pick o51 s5)
   deleted: (on o51 s5)
   added: (have o51)
   goals met: 0 of 9
3. (pick o4 s5)
   deleted: (on o4 s5)
   added: (have o4)
   goals met: 0 of 9
4. (pick o1 s5)
   deleted: (on o1 s5)
   added: (have o1)
   goals met: 0 of 9
5. (move s5 s2)
   deleted: (at s5)
   added: (at s2)
   goals met: 0 of 9
6. (pick o7 s2)
   deleted: (on o7 s2)
   added: (have o7)
   goals met: 0 of 9
7. (pick o52 s2)
   deleted: (on o52 s2)
   added: (have o52)
   goals met: 0 of 9
8. (pick o3 s2)
   deleted: (on o3 s2)
   added: (have o3)
   goals met: 0 of 9
9. (move s2 s3)
   deleted: (at s2)
   added: (at s3)
   goals met: 0 of 9
10. (pick o8 s3)
   deleted: (on o8 s3)
   added: (have o8)
   goals met: 0 of 9
11. (pick o6 s3)
   deleted: (on o6 s3)
   added: (have o6)
   goals met: 0 of 9
12. (pick o2 s3)
   deleted: (on o2 s3)
   added: (have o2)
   goals met: 0 of 9
13. (move s3 s4)
   deleted: (at s3)
   added: (at s4)
   goals met: 0 of 9
14. (drop o8 s4)
   deleted: (have o8)
   added: (on o8 s4)
   goals met: 1 of 9
15. (drop o52 s4)
   deleted: (have o52)
   added: (on o52 s4)
   goals met: 2 of 9
16. (drop o51 s4)
   deleted: (have o51)
   added: (on o51 s4)
   goals met: 3 of 9
17. (move s4 s6)
   deleted: (at s4)
   added: (at s6)
   goals met: 3 of 9
18. (drop o7 s6)
   deleted: (have o7)
   added: (on o7 s6)
   goals met: 4 of 9
19. (drop o2 s6)
   deleted: (have o2)
   added: (on o2 s6)
   goals met: 5 of 9
20. (drop o1 s6)
   deleted: (have o1)
   added: (on o1 s6)
   goals met: 6 of 9
21. (move s6 s1)
   deleted: (at s6)
   added: (at s1)
   goals met: 6 of 9
22. (drop o6 s1)
   deleted: (have o6)
   added: (on o6 s1)
   goals met: 7 of 9
23. (drop o4 s1)
   deleted: (have o4)
   added: (on o4 s1)
   goals met: 8 of 9
24. (drop o3 s1)
   deleted: (have o3)
   added: (on o3 s1)
   goals met: 9 of 9
